<?php
// +----------------------------------------------------------------------
// | MS
// +----------------------------------------------------------------------
// | Copyright (c) 2006~2030
// +----------------------------------------------------------------------
// | WeChat:m18312476724
// +----------------------------------------------------------------------
// | QQ:459157537
// +----------------------------------------------------------------------
// | Author: mali
// +----------------------------------------------------------------------
// | Date time: 2019/9/30 16:09
// +----------------------------------------------------------------------
// | purpose: 模板
// +----------------------------------------------------------------------
namespace App\model;

use Illuminate\Database\Eloquent\Model;
use Illuminate\Database\Eloquent\SoftDeletes;

class Templates extends Model
{
    use SoftDeletes;
    /**获取模型
     * @param $value
     * @return mixed
     */
    public function  getModelAttribute($value){
        $model=[
            0=>"",
            1=>"文章",
            2=>"产品",
            3=>"图片",
            4=>"视频",
            5=>"单页",
            6=>"模块",
        ];

        return $model[$value];
    }


    public function getClassAttribute($value){
        $data=[
            0=>"",
            1=>"列表",
            2=>"详情",
            3=>"频道",
        ];

        return $data[$value];
    }

}
